[{"title": "Heat and Dust Help Launch Martian Water Into Space, Scientists Find", "preview": "Scientists using an instrument aboard NASA’s Mars Atmosphere and Volatile EvolutioN, or MAVEN, spacecraft have discovered that water vapor near the surface of the Red Planet is lofted higher into the atmosphere than anyone expected was possible. "}, {"title": "Two of a Space Kind: Apollo 12 and Mars 2020", "preview": "Apollo 12 and the upcoming Mars 2020 mission may be separated by half a century, but they share several goals unique in the annals of space exploration."}, {"title": "NASA to Hold Mars 2020 Perseverance Rover Launch Briefing", "preview": "Learn more about the agency's next Red Planet mission during a live event on June 17."}, {"title": "Mars Helicopter Attached to NASA's Perseverance Rover", "preview": "The team also fueled the rover's sky crane to get ready for this summer's history-making launch."}, {"title": "NASA's Ingenuity Mars Helicopter Recharges Its Batteries in Flight", "preview": "Headed to the Red Planet with the Perseverance rover, the pioneering helicopter is powered up for the first time in interplanetary space as part of a systems check."}, {"title": "NASA Updates Mars 2020 Mission Environmental Review", "preview": "NASA and the Department of Energy have completed a more detailed risk analysis for the Mars 2020 rover launch from Florida."}, {"title": "NASA Moves Forward With Campaign to Return Mars Samples to Earth", "preview": "During this next phase, the program will mature critical technologies and make critical design decisions as well as assess industry partnerships."}, {"title": "Scientists Explore Outback as Testbed for Mars ", "preview": "Australia provides a great place for NASA's Mars 2020 and the ESA-Roscosmos ExoMars scientists to hone techniques in preparation for searching for signs ancient life on Mars."}, {"title": "NASA's Curiosity Takes Selfie With 'Mary Anning' on the Red Planet", "preview": "The Mars rover has drilled three samples of rock in this clay-enriched region since arriving in July."}, {"title": "NASA's Push to Save the Mars InSight Lander's Heat Probe", "preview": "The scoop on the end of the spacecraft's robotic arm will be used to 'pin' the mole against the wall of its hole."}, {"title": "NASA's Mars Rover Drivers Need Your Help", "preview": "Using an online tool to label Martian terrain types, you can train an artificial intelligence algorithm that could improve the way engineers guide the Curiosity rover."}, {"title": "NASA's Perseverance Rover Will Carry First Spacesuit Materials to Mars", "preview": "In a Q&A, spacesuit designer Amy Ross explains how five samples, including a piece of helmet visor, will be tested aboard the rover, which is targeting a July 30 launch. "}, {"title": "7 Things to Know About the Mars 2020 Perseverance Rover Mission", "preview": "NASA's next rover to the Red Planet is slated to launch no earlier than July 30. These highlights will get you up to speed on the ambitious mission."}, {"title": "The Extraordinary Sample-Gathering System of NASA's Perseverance Mars Rover", "preview": "Two astronauts collected Moon rocks on Apollo 11. It will take three robotic systems working together to gather up the first Mars rock samples for return to Earth."}, {"title": "The Man Who Wanted to Fly on Mars", "preview": "The Mars Helicopter is riding to the Red Planet this summer with NASA's Perseverance rover. The helicopter's chief engineer, Bob Balaram, shares the saga of how it came into being."}]